{
  "title" : "A Frozen Hiking Adventure",
  "dateNumber" : "02-14-2016",
  "dateText" : "February 14,2016",
  "dateMonth" : "february",
  "blurbText" : "Rather than writing about the hazards and my failure of doing anything particularly romantic this valentine day I wanted document some spectacular hiking experiences I experienced these past weeks. I went hiking on superbowl sunday and valentines day, at rocky mountain national park and at chataqua, respectively.",
  "id" : "788d4e94-ed0e-4bec-9af2-3fc2e3cf93e8",
  "url" : "article.html#/?id=788d4e94-ed0e-4bec-9af2-3fc2e3cf93e8",
  "articleComponents" : [ {
    "texts" : [ "Rather than writing about the hazards and my failure of doing anything particularly romantic this valentine day I wanted document some spectacular hiking experiences I experienced these past weeks. I went hiking on superbowl sunday and valentines day, at rocky mountain national park and at chataqua, respectively.", "Hiking in the winter is a great experience, these 2 times are really my first time trying it. I always thought the weather and snow would be prohibitive but in fact they enrich the experience and truly make it unique. The snow and ice affect the experience in 2 major ways. First snow and ice is cold and slippery, profound right? You need to be extra careful about the equipment you use and watch your step. Ice spikes on your feet are particularly critical as they allow actual climbing. On Valentines day,  I didn't use microspikes and I slipped and fell constantly. I was pretty lucky a couple times I didn't slide into great peril. Second the snow adds great contrast to the rest of the scenery. " ],
    "image" : [ "images/snowy_hiking/first.jpg" ]
  }, {
    "texts" : [ "I also saw some unique wildlife including a pair of moose. First time, I've ever saw moose. The word moose is so weird; the plural of moose is moose. Moose overall look disappointing though, their fur coat is dissapointingly sloppy and they look like strange cammels." ],
    "image" : [ "images/snowy_hiking/second.jpg" ]
  }, {
    "texts" : [ "Here are some elk, or deer, I don't know the difference. " ],
    "image" : [ " images/snowy_hiking/moose.jpg" ]
  }, {
    "texts" : [ "My favorite pictures are those of the mountains themselves. The clouds,the snow, the sun, the mountains and trees really blend together to create splendid panaromas. I need to visist again in the summer to see the lakes and how they add to the idyllic background. " ],
    "image" : [ "images/snowy_hiking/deer.jpg" ]
  }, {
    "texts" : [ "To top it off, I have a picture of me, in all my winter gear. Cheese!" ],
    "image" : [ "images/snowy_hiking/third.jpg", "images/snowy_hiking/fourth.jpg" ]
  }, {
    "texts" : [ ],
    "image" : [ "images/snowy_hiking/fifth.jpg" ]
  } ]
}
