{
  "title" : "The Judges of Life",
  "dateNumber" : "02-10-2016",
  "dateText" : "February 10, 2016",
  "dateMonth" : "february",
  "blurbText" : "One of the constants of life, I have really gotten annoyed of is the judging of people for there intelligence and skills. It is so hard to measure how good a worker, or student a person is. So I wanted to describe my challenges with this and perhaps my solution.",
  "id" : "9c64317a-90e3-4e4c-b177-d311eeb111c7",
  "url" : "article.html#/?id=9c64317a-90e3-4e4c-b177-d311eeb111c7",
  "articleComponents" : [ {
    "texts" : [ "One of the constants of life, I have really gotten annoyed of is the judging of people for there intelligence and skills. It is so hard to measure how good a worker, or student a person is. So I wanted to describe my challenges with this and perhaps my solution.", "Throughout life I have constantly vigorously competed in all sorts of competitions, whether it be piano, speech and debate, science olympiad, science bowl... every competition imaginable. In the end I used these competitions to help qualify myself for the best college possible.", "I thought I was an excellent student. I scored a 2280 on my SAT, I went to nationals in speech and debate. In speech and debate, I was a lead member in the team that went to nationals in IPPF. I routinely won top marks in science competitions and was of course an excellent student in just pure academics. I took over 13 AP exams in highschool and scored 5s or 4s in all of them and likewise had a 3.9 out of 4 GPA. ", "Yet even with these marks, I only got waitlisted in the top colleges. In fact I was waitlisted at Carnegie Mellon, Rice, UCBerkley and Northwestern. But in the end I didn't get in to any of these colleges. These results were perhaps one of the most depressing moments in my life. What am I missing, I got waitlisted everywhere but didn't get in anywhere. Do my competition results don't make me worthy atleast at one of these elite colleges." ],
    "image" : [ "images/judges_of_life/harvard.png" ]
  }, {
    "texts" : [ "Likewise I recently have been applying to jobs at all the high tech companies. My qualifications are much the same. I don't know my results yet, but now I question the process.", "The only real judge that should be used whether for college or work at a company should be the experience itself. Once people reach a certain set of qualifications companies and colleges should be willing to try more students. After a month, the company or the college could significantly better judge the applicant. Additionaly the applicant, herself could judge the environment of the company or college. The company or college may loose a small amount of resources training the person, or teaching the students. However a college can withheld a deposit, and likewise a company still gains work. ", "Alone these changes are also not sufficient, companies and colleges need to be more flexible and willing to change students and workers. Workers and students should be allowed to be equally as fickles as the admissions themselves. Transfering should be allowed at any time and classes and credit should be equally as transferable. This shouldn't be difficult as courses and content are very similar between colleges. Likewise technologies at companies in the same field is likewise comparable. " ],
    "image" : [ "images/judges_of_life/google.jpg", "images/judges_of_life/technology.jpg     " ]
  } ]
}