{
  "title" : "Election Potpourri",
  "dateNumber" : "02-21-2016",
  "dateText" : "February 21, 2016",
  "dateMonth" : "february",
  "blurbText" : "As the election primary heats up, I wanted to write a couple articles about my political views and some of the studies I have done. During this article I am going to go over my understanding of the election process and the differences I feel most core to each party.",
  "url" : "article.html#/?id=b9ccc0ea-69b4-4258-8e5b-f41c3a55b484",
  "dateDay" : 51,
  "articleComponents" : [ {
    "images" : [ "images/election_potpourri/elephant.gif" ],
    "texts" : [ "As the election primary heats up, I wanted to write a couple articles about my political views and some of the studies I have done. During this article I am going to go over my understanding of the election process and the differences I feel most core to each party.", "First, lets discuss the election in general. The election in the United States since its founding has been dominated by 2 parties currently the republican and democratic party. Every election has been won by one of these two parties. This long history of 2 parties has resulted in relatively polarized policies and substantial differences. The polarized policies and substantial differences is negative for the general person as most people has relatively moderate opinions and views.", "The following chart shows what I feel are the most significant differences between the parties." ]
  }, {
    "images" : [ "images/election_potpourri/major_differences.png" ],
    "texts" : [ "Of these factors and differences I feel economics and taxes are the most important and significant. Unfortunately though I don't strongly fit one party. I beleve a mix of the parties opinions is necessary. ", "First looking at economics, I think I believe in some government control and regulation is essential. Good examples of this are the EPA and the FDA. The EPA or environmental protection agency is especially critical at this time as global warming is a dire consequence that is profoundly effecting the planet currently. Likewise the FDA or food and drug administration is essential to safeguard the people against fake drugs, false medication. Without the food and drug administration the medical industry would be mired with zounds of harmful or useless drugs. Other regulations and industries though I feel are inhibitive. An example of this is the SEC and the excessive amount of litigations that occur over patents. The SEC is investigative organization that searches financial institutions for fraud. The SEC does not need to be preformed by the government. Whistleblowers and gurantees for fraud should be covered by the private domain. Since the SEC's creation, the number of IPOs has fallen by 60%. Finally patents, every year millions are lost to patents and patents really prevent innovation. Ideally patents should not be exploited for litigation rather whoever among the free market can make the best version based off a patent should be able to take advantage of the market. " ]
  }, {
    "images" : [ "images/election_potpourri/gravel.jpg" ],
    "texts" : [ "Second taxes. I believe the republicans got the right idea, we need to reduce taxes. Currently taxes are so complicated. There are 7 different tax brackets and innumerous loopholes and tax deducts. This tax policy needs to be changed. Additionally, even though I dont earn that much I feel that I am definitely taxed too much. " ]
  } ],
  "id" : "b9ccc0ea-69b4-4258-8e5b-f41c3a55b484"
}